# CannotSplitVerticallyCompoundWall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..CannotSplitVerticallyCompoundWall Property
BuiltInFailures..::..WallFailures Class See Also
---
Can't divide Wall's face to assign different materials to a vertically compound Wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotSplitVerticallyCompoundWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotSplitVerticallyCompoundWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotSplitVerticallyCompoundWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace